### Filtering Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
bios = pd.read_csv('data/bios.csv')

In [3]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [4]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [5]:
bios['born_country'].unique()

array(['FRA', 'GBR', nan, 'MAR', 'FPN', 'IRQ', 'USA', 'RSA', 'IRL', 'IND',
       'CHN', 'JAM', 'AUS', 'CAN', 'GER', 'ROU', 'BRA', 'CZE', 'RUS',
       'GRE', 'EGY', 'HUN', 'POL', 'MEX', 'SRB', 'SVK', 'INA', 'SRI',
       'PAK', 'ESP', 'AUT', 'BEL', 'BLR', 'BUL', 'CRC', 'DEN', 'EST',
       'FIN', 'SUI', 'GEO', 'ARG', 'ARM', 'BAH', 'CAM', 'CHI', 'ISR',
       'UZB', 'ITA', 'JPN', 'KOR', 'LAT', 'UKR', 'LTU', 'LUX', 'MAD',
       'MAS', 'MRI', 'NED', 'NGR', 'NOR', 'TUR', 'NZL', 'PAR', 'PER',
       'BAR', 'HKG', 'GUY', 'CGO', 'COD', 'CMR', 'COL', 'PUR', 'TPE',
       'VIE', 'CUB', 'DOM', 'CRO', 'ECU', 'ESA', 'MDA', 'MGL', 'ZIM',
       'PHI', 'POR', 'SLO', 'SWE', 'TJK', 'CIV', 'BIH', 'THA', 'CAF',
       'ALG', 'PRK', 'KAZ', 'UGA', 'TTO', 'TUN', 'AZE', 'URU', 'MYA',
       'VEN', 'ETH', 'FIJ', 'SEN', 'LBA', 'GAB', 'NCA', 'CUR', 'ARU',
       'ANG', 'Cologne', 'KOS', 'GHA', 'GUA', 'TLS', 'NEP', 'IRI', 'KEN',
       'KGZ', 'LBR', 'MAW', 'MLI', 'NAM', 'CPV', 'SUR', 'SLE', 'NIG',
       'PAN', 'SAM', 'TKM', 'MKD', 'SGP', 'MNE', 'SYR', 'MON', 'PNG',
       'BEN', 'ZAM', 'SUD', 'SSD', 'BDI', 'TAN', 'VAN', 'BOL', 'MLT',
       'JER', 'KSA', 'MOZ', 'BER', 'GRL', 'LBN', 'CYP', 'SMR', 'ERI',
       'LIE', 'GUM', 'BIZ', 'CAY', 'ALB', 'AND', 'Spreewald', 'MTS',
       'HAI', 'IOM', 'FLI', 'BAN', 'Vienna', 'NCD', 'GUI', 'KUW', 'STP',
       'GBS', 'QAT', 'SOM', 'TOG', 'Elster', 'ISL', 'Saale', 'Milde',
       'GIB', 'BUR', 'GUE', 'JOR', 'OMA', 'NFI', 'BRN', 'YEM', 'DMA',
       'GEQ', 'HON', 'SWZ', 'Prignitz', 'ANT', 'NRU', 'AFG', 'Altmark',
       'Munich', 'BOT', 'VIN', 'SKN', 'CHA', 'COM', 'DJI', 'MRT', 'MQE',
       'GAM', 'AGU', 'SEY', 'Havel', 'Luppe', 'GRN', 'LCA', 'PLE', 'SOL',
       'ASA', 'BHU', 'Upland', 'SMT', 'PLW', 'LES', 'UAE', 'TKS', 'KIR',
       'MDV', 'RWA', 'FSM', 'LAO', 'TGA', 'MHL', 'TUV', 'FAR', 'BRU',
       'MTN', 'COK', 'Corfu', 'IVB', 'Aarhus'], dtype=object)

In [6]:
"""
where the first portion is set for the the filtered column 
and the second part ins for the format of which the output should come out 

code shorthand(pandas shorthand)
bios[[height_cm] > 215] ['name', 'height_cm']
and this would have worked too
"""
bios.loc[(bios['height_cm']> 215) & (bios['born_country']=="FRA")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [7]:
"""
this is to find a specific thing in a column that contains something 
in a portion of itself
"""
bios[bios['name'].str.contains("Keith|Fred", case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
59,60,Winifred McNair,1877-08-09,Donnington,England,GBR,Great Britain,NaN,NaN,1954-03-28
77,78,Alfred Beamish,1879-08-06,Richmond,England,GBR,Great Britain,NaN,NaN,1944-02-28
167,168,Winifred Addy,1973-03-17,NaN,NaN,NaN,Ghana,NaN,NaN,NaN
490,491,Alfred Poupart,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN
514,516,Manfred Barth,1945-08-31,Hamburg,Hamburg,GER,West Germany,176.0,62.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143673,147327,Fred Kerley,1995-05-07,NaN,NaN,NaN,United States,NaN,NaN,NaN
144546,148238,Frederik Dichow,2001-03-01,NaN,NaN,NaN,Denmark,195.0,NaN,NaN
144566,148258,Frederik Storm,1989-02-20,Gentofte,Hovedstaden,DEN,Denmark,180.0,NaN,NaN
144727,148427,Frederik Tiffels,1995-05-20,Köln (Cologne),Nordrhein-Westfalen,GER,Germany,NaN,NaN,NaN
145309,149031,Fredrik Olofsson,1996-05-27,Helsingborg,Skåne,SWE,Sweden,NaN,NaN,NaN